/**
 * Склеивает и сортирует 2 массива
 * @param nums1 массив, в который мержится второй массив. В нем m собсвенных элементов и n нулей для перезаписи элементами второго массива
 * @param m количество собственных элементов первого массива 
 * @param nums2 второй массив
 * @param n длина второго массива
 */
function merge(nums1: number[], m: number, nums2: number[], n: number): void {
    for (let i = m; i < m + n; i++) {
        nums1[i] = nums2[i-m];
    }  
    nums1.sort((a,b)=>a-b);
};
// Тестовые данные
let nums1 = [-10,-10,-9,-9,-9,-8,-8,-7,-7,-7,-6,-6,-6,-6,-6,-6,-6,-5,-5,-5,-4,-4,-4,-3,-3,-2,-2,-1,-1,0,1,1,1,2,2,2,3,3,3,4,5,5,6,6,6,6,7,7,7,7,8,9,9,9,9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
let m = 55
let nums2 = [-10,-10,-9,-9,-9,-9,-8,-8,-8,-8,-8,-7,-7,-7,-7,-7,-7,-7,-7,-6,-6,-6,-6,-5,-5,-5,-5,-5,-4,-4,-4,-4,-4,-3,-3,-3,-2,-2,-2,-2,-2,-2,-2,-1,-1,-1,0,0,0,0,0,1,1,1,2,2,2,2,2,2,2,2,3,3,3,3,4,4,4,4,4,4,4,5,5,5,5,5,5,6,6,6,6,6,7,7,7,7,7,7,7,8,8,8,8,9,9,9,9]
let n = 99
merge(nums1, m, nums2, n);
console.log(nums1);


